Vulnerability Test Results/artillery-load-test.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:4000' }}"
  phases:
    - { duration: 60, arrivalRate: 100, name: Baseline }
    - { duration: 120, arrivalRate: 200, name: Stress }
    - { duration: 30, arrivalRate: 50, rampTo: 500, name: Spike }
scenarios:
  - name: Health smoke
    flow:
      - get: { url: "/health" }
